tests/perf/baseline.yml
config:
  target: "http://localhost:3101"
  phases:
    - duration: 300   # 5 minutes
      arrivalRate: 1  # 1 req/sec
      name: 'Baseline load'
  processor: './helpers.cjs'
  variables:
    apiKey: ""

scenarios:
  - name: 'Draft graph - baseline performance'
    flow:
      - post:
          url: '/assist/v1/draft-graph'
          headers:
            authorization: "Bearer {{ apiKey }}"
            content-type: "application/json"
          json:
            brief: '{{ brief }}'
          beforeRequest: 'selectBrief'
          capture:
            - json: '$.graph.nodes.length'
              as: 'nodeCount'
            - json: '$.confidence'
              as: 'confidence'
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: 'graph'